AccumulationRegisters/РасчетыСКлиентамиПоСрокам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСКлиентамиПоСрокам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Предоплата</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоплатаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоплатаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Долг</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолгРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолгУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПорядокЗачета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязанныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РасчетныйДокументСКлиентом</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоПлатежнойКарте</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистраторРасчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.РасчетКурсовыхРазниц</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПремииКлиенту</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоЯндексКассе</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТМЦВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаГрафикаВзаиморасчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупПринятыхНаХранениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Сторно</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковНДСПредъявленного</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупВозвратнойТарыКлиентом</v8:Type>
						<v8:Type>cfg:DocumentRef.АннулированиеПодарочныхСертификатов</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковПоФинансовымИнструментам</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОСписанииТоваровСХранения</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковПрочиеРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ВзаимозачетЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияПодарочныхСертификатов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратПодарочныхСертификатов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковОПродажахЗаПрошлыеПериоды</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупТоваровХранителем</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковВзаиморасчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковРасчетовПоЭквайрингу</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковСПодотчетниками</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОЗакупках</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковПрочихАктивовПассивов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорАналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчетовПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаУчетаПоПартнерамПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПриемник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоДаннымОбъектаРасчетовИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаписиВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаписейВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РасчетныйДокументСКлиентом</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлановогоПогашения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВозникновения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/РасчетКурсовыхРазниц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РасчетКурсовыхРазниц</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредстваУПодотчетныхЛиц</xr:Item>
				<xr:Item>AccumulationRegister.УдалитьПрочиеДоходы</xr:Item>
				<xr:Item>AccumulationRegister.ПрочиеРасходы</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках</xr:Item>
				<xr:Item>AccumulationRegister.ПрочиеАктивыПассивы</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваБезналичные</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияКонтрагентДоходыРасходы</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКОформлениюОтчетовКомитенту</xr:Item>
				<xr:Item>AccumulationRegister.ПрочиеДоходы</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваНаличные</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВПути</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВКассахККМ</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКлиентамиПоДокументам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияДенежныеСредстваДоходыРасходы</xr:Item>
				<xr:Item>AccumulationRegister.ПроцентныеРасходыДисконтирования</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоФинансовымИнструментам</xr:Item>
				<xr:Item>AccumulationRegister.УслугиКОформлениюОтчетовПринципалу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоценкаПоДням</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/КлючиАналитикиУчетаПоПартнерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КлючиАналитикиУчетаПоПартнерам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ВзаиморасчетыПереоценкаСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

//Пересчитывает все курсовые разницы за указанный период.
//
// Параметры:
//	МассивОрганизаций - Массив из СправочникСсылка.Организации- Перечень организаций по которым необходимо выполнить переоценку.
//	НачалоПериода - Дата - Начало периода пересчета курсовых разниц.
//	КонецПериода - Дата - Конец периода пересчета курсовых разниц.
//  Параметры - см. ПараметрыПереоценки
//
Процедура ВыполнитьПереоценкуЗаПериод(МассивОрганизаций, Знач НачалоПериода, Знач КонецПериода, Параметры) Экспорт
	
	ИмяЗамера = "Взаиморасчеты.РасчетКурсовыхРазницПоСрокам" + ?(Параметры.ЭтоРасчетыСКлиентами,".Клиенты",".Поставщики");
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(ИмяЗамера);
	Параметры.Вставить("ВсегоОбработано", 0);
	ДокументыПереоценки = Документы.РасчетКурсовыхРазниц.ДокументыПереоценкиПоОрганизациям(
		МассивОрганизаций, НачалоПериода, КонецПериода, Параметры.ЭтоРасчетыСКлиентами);	
	Параметры.Вставить("ДокументыПереоценки", ДокументыПереоценки);	
	ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками;
	Если Параметры.ЭтоРасчетыСКлиентами Тогда
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами;
	КонецЕсли;
	Параметры.Вставить("ХозяйственнаяОперация", ХозяйственнаяОперация);
	Параметры.Вставить("ВалютаУправленческогоУчета", Константы.ВалютаУправленческогоУчета.Получить());
	
	НачалоПериода = НачалоМесяца(НачалоПериода);
	КонецПериода = КонецМесяца(НачалоПериода);
	
	ДниПереоценки = ДниПереоценки(МассивОрганизаций, НачалоПериода, КонецПериода, Параметры);
	Параметры.Вставить("ДниПереоценки", ДниПереоценки);
	УдалитьКурсовыеРазницыЗаПериод(МассивОрганизаций, НачалоПериода, КонецПериода, Параметры);
	Для Каждого День Из ДниПереоценки Цикл
		Дата = День.Дата;
		Если КонецДня(День.Дата) = КонецМесяца(День.Дата) Тогда
			Дата = КонецДня(День.Дата);
		КонецЕсли;
		ВыполнитьПереоценкуНаДату(МассивОрганизаций, Дата, Параметры);
	КонецЦикла;
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, Параметры.ВсегоОбработано);
	
КонецПроцедуры

// Возвращает структуру параметров необходимых для регистрации документа к отложенному распределению расчетов.
// 
// Возвращаемое значение:
// 	Структура - Описание:
//  *ЭтоРасчетыСКлиентами - Булево - Истина если это расчеты с клиентами.
//  *ПереоценкаПоДням - Булево - Истина если необходимо переоценивать каждый день, иначе только по дням оплаты.
//  *ПерезаполнениеРегистровНУ - Булево - Истина если выполняется расчет курсовых по НУ.
//
Функция ПараметрыПереоценки(ЭтоРасчетыСКлиентами = Неопределено, ПереоценкаПоДням = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЭтоРасчетыСКлиентами", ЭтоРасчетыСКлиентами);
	
	Если ПереоценкаПоДням = Неопределено Тогда
		Результат.Вставить("ПереоценкаПоДням", Константы.ПереоцениватьВалютныеСредстваПоДням.Получить());
	Иначе
		Результат.Вставить("ПереоценкаПоДням", ПереоценкаПоДням);
	КонецЕсли;
	Результат.Вставить("ПерезаполнениеРегистровНУ", Ложь);

	Возврат Результат;
	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Добавляет записи переоценки на одну дату.
//
// Параметры:
//	МассивОрганизаций - Массив из СправочникСсылка.Организации - Перечень организаций по которым необходимо выполнить переоценку.
//	Период - Дата - Дата, на конец которой необходимо выполнить переоценку.
//  Параметры - см. ПараметрыПереоценки 
//
Процедура ВыполнитьПереоценкуНаДату(МассивОрганизаций, Период, Параметры) Экспорт

	ЭтоРасчетыСКлиентами = Параметры.ЭтоРасчетыСКлиентами;
	ПереоценкаПоДням = Параметры.ПереоценкаПоДням;
	
	Запрос = Новый Запрос;
	#Область ТекстЗапроса
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	АналитикиУчетаПоПартнерам.КлючАналитики                              КАК АналитикаУчетаПоПартнерам,
	|	АналитикиУчетаПоПартнерам.Организация                                КАК Организация,
	|	АналитикиУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|	&ВалютаУправленческогоУчета                                          КАК ВалютаУправленческогоУчета,
	|	АналитикиУчетаПоПартнерам.Договор                                    КАК Договор,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ПереоцениватьТоварыУслугиКОтчетуКомитенту, ЛОЖЬ) КАК ПереоцениватьТоварыУслугиКОтчетуКомитенту,
	|	НЕ ЕСТЬNULL(ДоговорыКонтрагентов.ПриПереоценкеЗадолженностиКлиентаНеПрименятьПоложения67ФЗ, ЛОЖЬ) КАК ПрименятьПоложения67ФЗ,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ТипДоговора, НЕОПРЕДЕЛЕНО)             КАК ТипДоговора,
	|	ЕСТЬNULL(
	|		ЕСТЬNULL(
	|			ДоговорыКонтрагентов.ВариантКурсаДоговора, 
	|			ДоговорыМеждуОрганизациями.ВариантКурсаДоговора), 
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный))         КАК ВариантКурсаДоговора
	|ПОМЕСТИТЬ ВтАналитикиУчетаПоПартнерам
	|ИЗ
	|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикиУчетаПоПартнерам 
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО АналитикиУчетаПоПартнерам.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыМеждуОрганизациями КАК ДоговорыМеждуОрганизациями
	|		ПО АналитикиУчетаПоПартнерам.Договор = ДоговорыМеждуОрганизациями.Ссылка
	|ГДЕ
	|	АналитикиУчетаПоПартнерам.Организация В (&МассивОрганизаций)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ВалютаРегламентированногоУчета,
	|	ВалютаУправленческогоУчета,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Обороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Обороты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Обороты.Валюта КАК Валюта,
	|	Обороты.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|	Обороты.РасчетныйДокумент КАК РасчетныйДокумент,
	|	Обороты.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	Обороты.ДатаВозникновения КАК ДатаВозникновения,
	|	Обороты.ДокументОплаты КАК ДокументОплаты,
	|	СУММА(Обороты.ДолгРасход) КАК ДолгРасход,
	|	СУММА(Обороты.ДолгРеглРасход) КАК ДолгРеглРасход,
	|	Обороты.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами
	|
	|ПОМЕСТИТЬ втОборотыПоДокументамОплаты
	|ИЗ
	|	(ВЫБРАТЬ
	|		Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Расчеты.Валюта КАК Валюта,
	|		Расчеты.АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|		Расчеты.РасчетныйДокумент КАК РасчетныйДокумент,
	|		Расчеты.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|		Расчеты.ДатаВозникновения КАК ДатаВозникновения,
	|		ВЫБОР КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА Расчеты.Долг
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ДолгРасход,
	|		ВЫБОР КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА Расчеты.ДолгРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ДолгРеглРасход,
	|		Расчеты.ДокументРегистратор КАК ДокументОплаты,
	|		&ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикиУчетаПоПартнерам КАК Аналитика
	|			ПО Расчеты.АналитикаУчетаПоПартнерам = Аналитика.АналитикаУчетаПоПартнерам
	|				И (Расчеты.Валюта <> Аналитика.ВалютаРегламентированногоУчета
	|					ИЛИ Расчеты.Валюта <> &ВалютаУправленческогоУчета)
	|		ГДЕ
	|			Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|			И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			И ТИПЗНАЧЕНИЯ(Расчеты.ДокументРегистратор) <> ТИП(Документ.РасчетКурсовыхРазниц)
	|			И Расчеты.Долг <> 0
	|			И Расчеты.ХозяйственнаяОперация <> &ЗачетАванса
	|	) КАК Обороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Обороты.АналитикаУчетаПоПартнерам,
	|	Обороты.ОбъектРасчетов,
	|	Обороты.Валюта,
	|	Обороты.ВалютаРегламентированногоУчета,
	|	Обороты.РасчетныйДокумент,
	|	Обороты.ДатаПлановогоПогашения,
	|	Обороты.ДатаВозникновения,
	|	Обороты.ДокументОплаты,
	|	Обороты.ЭтоРасчетыСКлиентами
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Валюта,
	|	РасчетныйДокумент,
	|	ДатаПлановогоПогашения,
	|	ДатаВозникновения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Обороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Обороты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Обороты.Валюта КАК Валюта,
	|	Обороты.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|	Обороты.РасчетныйДокумент КАК РасчетныйДокумент,
	|	Обороты.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	Обороты.ДатаВозникновения КАК ДатаВозникновения,
	|	СУММА(Обороты.ДолгРасход) КАК ДолгРасход,
	|	СУММА(Обороты.ДолгРеглРасход) КАК ДолгРеглРасход,
	|	Обороты.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами
	|
	|ПОМЕСТИТЬ втОборотыЗаДень
	|ИЗ
	|	втОборотыПоДокументамОплаты КАК Обороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Обороты.АналитикаУчетаПоПартнерам,
	|	Обороты.ОбъектРасчетов,
	|	Обороты.Валюта,
	|	Обороты.ВалютаРегламентированногоУчета,
	|	Обороты.РасчетныйДокумент,
	|	Обороты.ДатаПлановогоПогашения,
	|	Обороты.ДатаВозникновения,
	|	Обороты.ЭтоРасчетыСКлиентами
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Валюта,
	|	РасчетныйДокумент,
	|	ДатаПлановогоПогашения,
	|	ДатаВозникновения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Обороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Обороты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Обороты.Валюта КАК Валюта,
	|	Обороты.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|	Обороты.РасчетныйДокумент КАК РасчетныйДокумент,
	|	СУММА(Обороты.ДолгРасход) КАК ДолгРасход,
	|	СУММА(Обороты.ДолгРеглРасход) КАК ДолгРеглРасход,
	|	Обороты.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами
	|
	|ПОМЕСТИТЬ втОборотыЗаДеньБезДат
	|ИЗ
	|	втОборотыПоДокументамОплаты КАК Обороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Обороты.АналитикаУчетаПоПартнерам,
	|	Обороты.ОбъектРасчетов,
	|	Обороты.Валюта,
	|	Обороты.ВалютаРегламентированногоУчета,
	|	Обороты.РасчетныйДокумент,
	|	Обороты.ЭтоРасчетыСКлиентами
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Валюта,
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиИОбороты.АналитикаУчетаПоПартнерам    КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиИОбороты.ОбъектРасчетов               КАК ОбъектРасчетов,
	|	ОстаткиИОбороты.Валюта                       КАК Валюта,
	|	ОстаткиИОбороты.ВалютаРегл                   КАК ВалютаРегл,
	|	ОстаткиИОбороты.РасчетныйДокумент            КАК РасчетныйДокумент,
	|	ОстаткиИОбороты.ДатаПлановогоПогашения       КАК ДатаПлановогоПогашения,
	|	ОстаткиИОбороты.ДатаВозникновения            КАК ДатаВозникновения,
	|	ОстаткиИОбороты.ВариантКурсаДоговора         КАК ВариантКурсаДоговора,
	|	СУММА(ОстаткиИОбороты.ПредоплатаОстаток)     КАК ПредоплатаОстаток,
	|	СУММА(ОстаткиИОбороты.ПредоплатаРеглОстаток) КАК ПредоплатаРеглОстаток,
	|	СУММА(ОстаткиИОбороты.ПредоплатаУпрОстаток)  КАК ПредоплатаУпрОстаток,
	|	СУММА(ОстаткиИОбороты.ДолгОстаток)           КАК ДолгОстаток,
	|	СУММА(ОстаткиИОбороты.ДолгРеглОстаток)       КАК ДолгРеглОстаток,
	|	СУММА(ОстаткиИОбороты.ДолгУпрОстаток)        КАК ДолгУпрОстаток,
	|	ОстаткиИОбороты.ЭтоРасчетыСКлиентами         КАК ЭтоРасчетыСКлиентами
	|ПОМЕСТИТЬ втОстаткиНаКонецДня
	|ИЗ 
	|	(ВЫБРАТЬ
	|		РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПоСрокамОстатки.ОбъектРасчетов            КАК ОбъектРасчетов,
	|		РасчетыПоСрокамОстатки.Валюта                    КАК Валюта,
	|		АналитикиУчетаПоПартнерам.ВалютаРегламентированногоУчета   КАК ВалютаРегл,
	|		РасчетыПоСрокамОстатки.РасчетныйДокумент         КАК РасчетныйДокумент,
	|		РасчетыПоСрокамОстатки.ДатаПлановогоПогашения    КАК ДатаПлановогоПогашения,
	|		РасчетыПоСрокамОстатки.ДатаВозникновения         КАК ДатаВозникновения,
	|		АналитикиУчетаПоПартнерам.ВариантКурсаДоговора             КАК ВариантКурсаДоговора,
	|		РасчетыПоСрокамОстатки.ПредоплатаОстаток         КАК ПредоплатаОстаток,
	|		РасчетыПоСрокамОстатки.ПредоплатаРеглОстаток     КАК ПредоплатаРеглОстаток,
	|		РасчетыПоСрокамОстатки.ПредоплатаУпрОстаток      КАК ПредоплатаУпрОстаток,
	|		РасчетыПоСрокамОстатки.ДолгОстаток               КАК ДолгОстаток,
	|		РасчетыПоСрокамОстатки.ДолгРеглОстаток           КАК ДолгРеглОстаток,
	|		РасчетыПоСрокамОстатки.ДолгУпрОстаток            КАК ДолгУпрОстаток,
	|		&ЭтоРасчетыСКлиентами                            КАК ЭтоРасчетыСКлиентами
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	|				&НачалоПериода,
	|				НЕ (Валюта, Валюта) В (
	|					ВЫБРАТЬ 
	|						АналитикиУчетаПоПартнерам.ВалютаРегламентированногоУчета,
	|						АналитикиУчетаПоПартнерам.ВалютаУправленческогоУчета
	|					ИЗ
	|						ВтАналитикиУчетаПоПартнерам КАК АналитикиУчетаПоПартнерам
	|					)
	|			) КАК РасчетыПоСрокамОстатки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикиУчетаПоПартнерам КАК АналитикиУчетаПоПартнерам
	|				ПО РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам = АналитикиУчетаПоПартнерам.АналитикаУчетаПоПартнерам
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		РасчетыПоСрокамОбороты.АналитикаУчетаПоПартнерам         КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПоСрокамОбороты.ОбъектРасчетов                    КАК ОбъектРасчетов,
	|		РасчетыПоСрокамОбороты.Валюта                            КАК Валюта,
	|		АналитикиУчетаПоПартнерам.ВалютаРегламентированногоУчета   КАК ВалютаРегл,
	|		РасчетыПоСрокамОбороты.РасчетныйДокумент                 КАК РасчетныйДокумент,
	|		РасчетыПоСрокамОбороты.ДатаПлановогоПогашения            КАК ДатаПлановогоПогашения,
	|		РасчетыПоСрокамОбороты.ДатаВозникновения                 КАК ДатаВозникновения,
	|		АналитикиУчетаПоПартнерам.ВариантКурсаДоговора             КАК ВариантКурсаДоговора,
	|		ВЫБОР КОГДА РасчетыПоСрокамОбороты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА РасчетыПоСрокамОбороты.Предоплата
	|			ИНАЧЕ -РасчетыПоСрокамОбороты.Предоплата
	|		КОНЕЦ                                                      КАК ПредоплатаОстаток,
	|		ВЫБОР КОГДА РасчетыПоСрокамОбороты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА РасчетыПоСрокамОбороты.ПредоплатаРегл
	|			ИНАЧЕ -РасчетыПоСрокамОбороты.ПредоплатаРегл
	|		КОНЕЦ                                                      КАК ПредоплатаРеглОстаток,
	|		ВЫБОР КОГДА РасчетыПоСрокамОбороты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА РасчетыПоСрокамОбороты.ПредоплатаУпр
	|			ИНАЧЕ -РасчетыПоСрокамОбороты.ПредоплатаУпр
	|		КОНЕЦ                                                      КАК ПредоплатаУпрОстаток,
	|		ВЫБОР КОГДА РасчетыПоСрокамОбороты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА РасчетыПоСрокамОбороты.Долг
	|			ИНАЧЕ -РасчетыПоСрокамОбороты.Долг
	|		КОНЕЦ                                                      КАК ДолгОстаток,
	|		ВЫБОР КОГДА РасчетыПоСрокамОбороты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА РасчетыПоСрокамОбороты.ДолгРегл
	|			ИНАЧЕ -РасчетыПоСрокамОбороты.ДолгРегл
	|		КОНЕЦ                                                      КАК ДолгРеглОстаток,
	|		ВЫБОР КОГДА РасчетыПоСрокамОбороты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА РасчетыПоСрокамОбороты.ДолгУпр
	|			ИНАЧЕ -РасчетыПоСрокамОбороты.ДолгУпр
	|		КОНЕЦ                                                      КАК ДолгУпрОстаток,
	|		&ЭтоРасчетыСКлиентами                                      КАК ЭтоРасчетыСКлиентами
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокамОбороты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикиУчетаПоПартнерам КАК АналитикиУчетаПоПартнерам
	|				ПО РасчетыПоСрокамОбороты.АналитикаУчетаПоПартнерам = АналитикиУчетаПоПартнерам.АналитикаУчетаПоПартнерам
	|				И (РасчетыПоСрокамОбороты.Валюта <> АналитикиУчетаПоПартнерам.ВалютаРегламентированногоУчета
	|						ИЛИ РасчетыПоСрокамОбороты.Валюта <> АналитикиУчетаПоПартнерам.ВалютаУправленческогоУчета)
	|	ГДЕ
	|		РасчетыПоСрокамОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ТИПЗНАЧЕНИЯ(РасчетыПоСрокамОбороты.ДокументРегистратор) <> ТИП(Документ.РасчетКурсовыхРазниц)
	|) КАК ОстаткиИОбороты
	|		
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиИОбороты.АналитикаУчетаПоПартнерам ,
	|	ОстаткиИОбороты.ОбъектРасчетов,
	|	ОстаткиИОбороты.Валюта,
	|	ОстаткиИОбороты.ВалютаРегл,
	|	ОстаткиИОбороты.РасчетныйДокумент,
	|	ОстаткиИОбороты.ДатаПлановогоПогашения,
	|	ОстаткиИОбороты.ДатаВозникновения,
	|	ОстаткиИОбороты.ВариантКурсаДоговора,
	|	ОстаткиИОбороты.ЭтоРасчетыСКлиентами
	|	
	|ИМЕЮЩИЕ
	|	СУММА(ОстаткиИОбороты.ПредоплатаОстаток) <> 0
	|	ИЛИ СУММА(ОстаткиИОбороты.ПредоплатаРеглОстаток) <> 0
	|	ИЛИ СУММА(ОстаткиИОбороты.ПредоплатаУпрОстаток) <> 0
	|	ИЛИ СУММА(ОстаткиИОбороты.ДолгОстаток) <> 0
	|	ИЛИ СУММА(ОстаткиИОбороты.ДолгРеглОстаток) <> 0
	|	ИЛИ СУММА(ОстаткиИОбороты.ДолгУпрОстаток) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Валюта,
	|	РасчетныйДокумент,
	|	ДатаПлановогоПогашения,
	|	ДатаВозникновения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсВалюты.Валюта КАК Валюта,
	|	КурсВалюты.БазоваяВалюта КАК БазоваяВалюта,
	|	КурсВалюты.КурсЧислитель КАК КурсЧислитель,
	|	КурсВалюты.КурсЗнаменатель КАК КурсЗнаменатель
	|ПОМЕСТИТЬ втКурсыВалют
	|ИЗ
	|	РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&ГраницаКонецДня) КАК КурсВалюты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютПоДоговорам.Договор КАК Договор,
	|	КурсыВалютПоДоговорам.КурсЧислитель КАК КурсЧислитель,
	|	КурсыВалютПоДоговорам.КурсЗнаменатель КАК КурсЗнаменатель
	|ПОМЕСТИТЬ втКурсыВалютПоДоговорам
	|ИЗ
	|	РегистрСведений.КурсыВалютРасчетовПоДоговорам.СрезПоследних(&ГраницаКонецДня) КАК КурсыВалютПоДоговорам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаКонецДня.АналитикаУчетаПоПартнерам                      КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиНаКонецДня.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|	ОстаткиНаКонецДня.Валюта                                         КАК Валюта,
	|	ОстаткиНаКонецДня.ВалютаРегл                                     КАК ВалютаРегл,
	|	ОстаткиНаКонецДня.РасчетныйДокумент                              КАК РасчетныйДокумент,
	|	ОстаткиНаКонецДня.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
	|	ОстаткиНаКонецДня.ДатаВозникновения                              КАК ДатаВозникновения,
	|	АналитикиУчетаПоПартнерам.ВариантКурсаДоговора                   КАК ВариантКурсаДоговора,
	|	АналитикиУчетаПоПартнерам.ПереоцениватьТоварыУслугиКОтчетуКомитенту КАК ПереоцениватьТоварыУслугиКОтчетуКомитенту,
	|	АналитикиУчетаПоПартнерам.ПрименятьПоложения67ФЗ                 КАК ПрименятьПоложения67ФЗ,
	|	АналитикиУчетаПоПартнерам.ТипДоговора                            КАК ТипДоговора,
	|	ОстаткиНаКонецДня.ПредоплатаОстаток                              КАК ПредоплатаОстаток,
	|	ОстаткиНаКонецДня.ПредоплатаРеглОстаток                          КАК ПредоплатаРеглОстаток,
	|	ОстаткиНаКонецДня.ПредоплатаУпрОстаток                           КАК ПредоплатаУпрОстаток,
	|	ОстаткиНаКонецДня.ДолгОстаток                                    КАК ДолгОстаток,
	|	ОстаткиНаКонецДня.ДолгРеглОстаток                                КАК ДолгРеглОстаток,
	|	ОстаткиНаКонецДня.ДолгУпрОстаток                                 КАК ДолгУпрОстаток,
	|	ВЫБОР КОГДА АналитикиУчетаПоПартнерам.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|			ТОГДА ЕСТЬNULL(КурсыВалютПоДоговорам.КурсЧислитель,1)
	|		КОГДА АналитикиУчетаПоПартнерам.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|				И ОстаткиНаКонецДня.ОбъектРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|			ТОГДА ЕСТЬNULL(КурсыВалютПоДокументам.КурсЧислительВалютыВзаиморасчетов,1)
	|		ИНАЧЕ 
	|			ЕСТЬNULL(КурсыВалют.КурсЧислитель,1)
	|	КОНЕЦ                                                                           КАК КурсЧислительРегл,
	|	ВЫБОР КОГДА АналитикиУчетаПоПартнерам.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|			ТОГДА ЕСТЬNULL(КурсыВалютПоДоговорам.КурсЗнаменатель,1)
	|		КОГДА АналитикиУчетаПоПартнерам.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|				И ОстаткиНаКонецДня.ОбъектРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|			ТОГДА ЕСТЬNULL(КурсыВалютПоДокументам.КурсЗнаменательВалютыВзаиморасчетов,1)
	|		ИНАЧЕ
	|			ЕСТЬNULL(КурсыВалют.КурсЗнаменатель,1)
	|	КОНЕЦ                                                                           КАК КурсЗнаменательРегл,
	|	ВЫБОР КОГДА АналитикиУчетаПоПартнерам.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|					И ОстаткиНаКонецДня.Валюта = &ВалютаУправленческогоУчета
	|			ТОГДА ЕСТЬNULL(КурсыВалютПоДоговорам.КурсЧислитель,1)
	|		КОГДА АналитикиУчетаПоПартнерам.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|				И ОстаткиНаКонецДня.ОбъектРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|			ТОГДА 
	|				ЕСТЬNULL(КурсыВалютПоДокументам.КурсЧислительВалютыУправленческогоУчета,1)
	|		ИНАЧЕ
	|			ЕСТЬNULL(КурсВалютыУпр.КурсЧислитель,1)
	|	КОНЕЦ                                                                           КАК КурсЧислительУпр,
	|	ВЫБОР КОГДА АналитикиУчетаПоПартнерам.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|					И ОстаткиНаКонецДня.Валюта = &ВалютаУправленческогоУчета
	|			ТОГДА ЕСТЬNULL(КурсыВалютПоДоговорам.КурсЗнаменатель,1)
	|		КОГДА АналитикиУчетаПоПартнерам.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|				И ОстаткиНаКонецДня.ОбъектРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|			ТОГДА 
	|				ЕСТЬNULL(КурсыВалютПоДокументам.КурсЗнаменательВалютыУправленческогоУчета,1)
	|		ИНАЧЕ 
	|			ЕСТЬNULL(КурсВалютыУпр.КурсЗнаменатель,1)
	|	КОНЕЦ                                                                           КАК КурсЗнаменательУпр,
	|	ОстаткиНаКонецДня.ЭтоРасчетыСКлиентами                                          КАК ЭтоРасчетыСКлиентами
	|ПОМЕСТИТЬ ВтОстаткиСКурсами
	|ИЗ
	|	втОстаткиНаКонецДня КАК ОстаткиНаКонецДня
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикиУчетаПоПартнерам КАК АналитикиУчетаПоПартнерам
	|			ПО ОстаткиНаКонецДня.АналитикаУчетаПоПартнерам = АналитикиУчетаПоПартнерам.АналитикаУчетаПоПартнерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалютыУпр
	|			ПО ОстаткиНаКонецДня.ВалютаРегл = КурсВалютыУпр.БазоваяВалюта
	|			И КурсВалютыУпр.Валюта = &ВалютаУправленческогоУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсыВалют
	|			ПО ОстаткиНаКонецДня.Валюта = КурсыВалют.Валюта
	|			И ОстаткиНаКонецДня.ВалютаРегл = КурсыВалют.БазоваяВалюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалютПоДоговорам КАК КурсыВалютПоДоговорам
	|			ПО КурсыВалютПоДоговорам.Договор = АналитикиУчетаПоПартнерам.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВалютыИКурсыДокументов КАК КурсыВалютПоДокументам
	|			ПО ОстаткиНаКонецДня.ОбъектРасчетов.Объект = КурсыВалютПоДокументам.Документ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Валюта,
	|	РасчетныйДокумент,
	|	ДатаПлановогоПогашения,
	|	ДатаВозникновения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтОстаткиСКурсами.АналитикаУчетаПоПартнерам                      КАК АналитикаУчетаПоПартнерам,
	|	ВтОстаткиСКурсами.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|	ВтОстаткиСКурсами.Валюта                                         КАК Валюта,
	|	ВтОстаткиСКурсами.РасчетныйДокумент                              КАК РасчетныйДокумент,
	|	ВтОстаткиСКурсами.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
	|	ВтОстаткиСКурсами.ДатаВозникновения                              КАК ДатаВозникновения,
	|	ВтОстаткиСКурсами.ВариантКурсаДоговора                           КАК ВариантКурсаДоговора,
	|	ВтОстаткиСКурсами.ПереоцениватьТоварыУслугиКОтчетуКомитенту      КАК ПереоцениватьТоварыУслугиКОтчетуКомитенту,
	|	ВтОстаткиСКурсами.ПрименятьПоложения67ФЗ                         КАК ПрименятьПоложения67ФЗ,
	|	ВтОстаткиСКурсами.ТипДоговора                                    КАК ТипДоговора,
	|	ВтОстаткиСКурсами.ПредоплатаОстаток                              КАК ПредоплатаОстаток,
	|	ВтОстаткиСКурсами.ПредоплатаРеглОстаток                          КАК ПредоплатаРеглОстаток,
	|	ВтОстаткиСКурсами.ПредоплатаУпрОстаток                           КАК ПредоплатаУпрОстаток,
	|	ЕСТЬNULL(ОборотыЗаДень.ДолгРасход, 0)                            КАК ДолгРасход,
	|	ЕСТЬNULL(ОборотыЗаДень.ДолгРеглРасход, 0)                        КАК ДолгРеглРасход,
	|	ВтОстаткиСКурсами.ДолгОстаток                                    КАК ДолгОстаток,
	|	ВтОстаткиСКурсами.ДолгРеглОстаток                                КАК ДолгРеглОстаток,
	|	ВтОстаткиСКурсами.КурсЧислительРегл 
	|		/ ВтОстаткиСКурсами.КурсЗнаменательРегл                      КАК КурсРегл,
	|	ВЫРАЗИТЬ(ВтОстаткиСКурсами.ДолгОстаток 
	|		* ВтОстаткиСКурсами.КурсЧислительРегл / ВтОстаткиСКурсами.КурсЗнаменательРегл КАК ЧИСЛО(31,2)) КАК ДолгРеглОстатокРасчетный,
	|	ВтОстаткиСКурсами.ДолгУпрОстаток                                 КАК ДолгУпрОстаток,
	|	ВЫРАЗИТЬ(ВтОстаткиСКурсами.ДолгОстаток 
	|		* ВтОстаткиСКурсами.КурсЧислительРегл / ВтОстаткиСКурсами.КурсЗнаменательРегл
	|			/ ВтОстаткиСКурсами.КурсЧислительУпр * ВтОстаткиСКурсами.КурсЗнаменательУпр КАК ЧИСЛО(31,2)) КАК ДолгУпрОстатокРасчетный,
	|	ВтОстаткиСКурсами.ЭтоРасчетыСКлиентами                           КАК ЭтоРасчетыСКлиентами
	|ПОМЕСТИТЬ ВтКРасчету
	|ИЗ
	|	ВтОстаткиСКурсами КАК ВтОстаткиСКурсами
	|	ЛЕВОЕ СОЕДИНЕНИЕ втОборотыЗаДень КАК ОборотыЗаДень
	|		ПО ВтОстаткиСКурсами.АналитикаУчетаПоПартнерам = ОборотыЗаДень.АналитикаУчетаПоПартнерам
	|			И ВтОстаткиСКурсами.ОбъектРасчетов = ОборотыЗаДень.ОбъектРасчетов
	|			И ВтОстаткиСКурсами.Валюта = ОборотыЗаДень.Валюта
	|			И ВтОстаткиСКурсами.РасчетныйДокумент = ОборотыЗаДень.РасчетныйДокумент
	|			И ВтОстаткиСКурсами.ДатаПлановогоПогашения = ОборотыЗаДень.ДатаПлановогоПогашения
	|			И ВтОстаткиСКурсами.ДатаВозникновения = ОборотыЗаДень.ДатаВозникновения
	|ГДЕ
	|	(НЕ ОборотыЗаДень.ОбъектРасчетов ЕСТЬ NULL
	|		ИЛИ &ДатаРасчета = КОНЕЦПЕРИОДА(&ДатаРасчета, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ВтОстаткиСКурсами.ДолгРеглОстаток
	|			- ВЫРАЗИТЬ(ВтОстаткиСКурсами.ДолгОстаток 
	|			* ВтОстаткиСКурсами.КурсЧислительРегл / ВтОстаткиСКурсами.КурсЗнаменательРегл КАК ЧИСЛО(31,2)) >= 0.01 
	|		ИЛИ ВтОстаткиСКурсами.ДолгРеглОстаток
	|			- ВЫРАЗИТЬ(ВтОстаткиСКурсами.ДолгОстаток 
	|			* ВтОстаткиСКурсами.КурсЧислительРегл / ВтОстаткиСКурсами.КурсЗнаменательРегл КАК ЧИСЛО(31,2)) <= -0.01 
	|		ИЛИ ВтОстаткиСКурсами.ДолгУпрОстаток
	|			- ВЫРАЗИТЬ(ВтОстаткиСКурсами.ДолгОстаток 
	|			* ВтОстаткиСКурсами.КурсЧислительРегл / ВтОстаткиСКурсами.КурсЗнаменательРегл
	|				/ ВтОстаткиСКурсами.КурсЧислительУпр * ВтОстаткиСКурсами.КурсЗнаменательУпр КАК ЧИСЛО(31,2)) >= 0.01
	|		ИЛИ ВтОстаткиСКурсами.ДолгУпрОстаток
	|			- ВЫРАЗИТЬ(ВтОстаткиСКурсами.ДолгОстаток 
	|			* ВтОстаткиСКурсами.КурсЧислительРегл / ВтОстаткиСКурсами.КурсЗнаменательРегл
	|				/ ВтОстаткиСКурсами.КурсЧислительУпр * ВтОстаткиСКурсами.КурсЗнаменательУпр КАК ЧИСЛО(31,2)) <= -0.01
	|		ИЛИ ВтОстаткиСКурсами.ПредоплатаОстаток = 0
	|			И (ВтОстаткиСКурсами.ПредоплатаРеглОстаток <> 0
	|				ИЛИ ВтОстаткиСКурсами.ПредоплатаУпрОстаток <> 0)
	|		ИЛИ ВтОстаткиСКурсами.ДолгОстаток = 0
	|			И (ВтОстаткиСКурсами.ДолгРеглОстаток <> 0
	|				ИЛИ ВтОстаткиСКурсами.ДолгУпрОстаток <> 0))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Валюта,
	|	РасчетныйДокумент,
	|	ДатаПлановогоПогашения,
	|	ДатаВозникновения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОстаткиНаКонецДня.ОбъектРасчетов              КАК ОбъектРасчетов,
	|	ОстаткиНаКонецДня.АналитикаУчетаПоПартнерам   КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиНаКонецДня.Валюта                      КАК Валюта,
	|	ОстаткиНаКонецДня.ЭтоРасчетыСКлиентами        КАК ЭтоРасчетыСКлиентами
	|ПОМЕСТИТЬ втАналитикаОстатков
	|ИЗ 
	|	втОстаткиНаКонецДня КАК ОстаткиНаКонецДня
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРасчетов,
	|	АналитикаУчетаПоПартнерам,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистраторРасчетов.Ссылка                      КАК Ссылка,
	|	РегистраторРасчетов.ОбъектРасчетов              КАК ОбъектРасчетов,
	|	РегистраторРасчетов.АналитикаУчетаПоПартнерам   КАК АналитикаУчетаПоПартнерам,
	|	РегистраторРасчетов.Валюта                      КАК Валюта,
	|	АналитикаОстатков.ЭтоРасчетыСКлиентами          КАК ЭтоРасчетыСКлиентами,
	|	КОЛИЧЕСТВО(ЕСТЬNULL(Таблица.НомерСтроки,0))     КАК ВсегоЗаписей
	|ИЗ
	|	Документ.РегистраторРасчетов КАК РегистраторРасчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАналитикаОстатков КАК АналитикаОстатков
	|			ПО АналитикаОстатков.ОбъектРасчетов = РегистраторРасчетов.ОбъектРасчетов
	|				И АналитикаОстатков.АналитикаУчетаПоПартнерам = РегистраторРасчетов.АналитикаУчетаПоПартнерам
	|				И АналитикаОстатков.Валюта = РегистраторРасчетов.Валюта
	|				И РегистраторРасчетов.ТипРасчетов = &ТипРасчетов
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ #ИмяТаблицы КАК Таблица
	|			ПО Таблица.Регистратор = РегистраторРасчетов.Ссылка
	|		
	|СГРУППИРОВАТЬ ПО
	|	РегистраторРасчетов.Ссылка,
	|	РегистраторРасчетов.ОбъектРасчетов,
	|	РегистраторРасчетов.АналитикаУчетаПоПартнерам,
	|	РегистраторРасчетов.Валюта,
	|	АналитикаОстатков.ЭтоРасчетыСКлиентами
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЕСТЬNULL(Таблица.НомерСтроки,0)) < &РазмерПорции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыПоСрокамОбороты.Регистратор                       КАК Регистратор,
	|	&ЭтоРасчетыСКлиентами                                    КАК ЭтоРасчетыСКлиентами
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокамОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикиУчетаПоПартнерам КАК АналитикиУчетаПоПартнерам
	|			ПО РасчетыПоСрокамОбороты.АналитикаУчетаПоПартнерам = АналитикиУчетаПоПартнерам.АналитикаУчетаПоПартнерам
	|ГДЕ
	|	РасчетыПоСрокамОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТИПЗНАЧЕНИЯ(РасчетыПоСрокамОбороты.ДокументРегистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.АналитикаУчетаПоПартнерам                      КАК АналитикаУчетаПоПартнерам,
	|	Т.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|	Т.Валюта                                         КАК Валюта,
	|	Т.ЭтоРасчетыСКлиентами                           КАК ЭтоРасчетыСКлиентами,
	|	Т.Организация                                    КАК Организация
	|ИЗ (
	|	ВЫБРАТЬ
	|		ВтКРасчету.АналитикаУчетаПоПартнерам         КАК АналитикаУчетаПоПартнерам,
	|		ВтКРасчету.ОбъектРасчетов                    КАК ОбъектРасчетов,
	|		ВтКРасчету.Валюта                            КАК Валюта,
	|		ВтКРасчету.ЭтоРасчетыСКлиентами              КАК ЭтоРасчетыСКлиентами,
	|		Аналитика.Организация                        КАК Организация
	|	ИЗ ВтКРасчету КАК ВтКРасчету
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ПО ВтКРасчету.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|) КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтКРасчету.ЭтоРасчетыСКлиентами                  КАК ЭтоРасчетыСКлиентами,
	|	ВтКРасчету.АналитикаУчетаПоПартнерам             КАК АналитикаУчетаПоПартнерам,
	|	ВтКРасчету.ОбъектРасчетов                        КАК ОбъектРасчетов,
	|	ВтКРасчету.Валюта                                КАК Валюта,
	|	ВтКРасчету.РасчетныйДокумент                     КАК РасчетныйДокумент,
	|	ВтКРасчету.ДатаПлановогоПогашения                КАК ДатаПлановогоПогашения,
	|	ВтКРасчету.ДатаВозникновения                     КАК ДатаВозникновения,
	|	ВтКРасчету.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	ВтКРасчету.ВариантКурсаДоговора                  КАК ВариантКурсаДоговора,
	|	ВтКРасчету.ДолгРеглОстаток                       КАК ДолгРеглОстаток,
	|	ВтКРасчету.ДолгРеглОстатокРасчетный              КАК ДолгРеглОстатокРасчетный,
	|	ВтКРасчету.ДолгУпрОстаток                        КАК ДолгУпрОстаток,
	|	ВтКРасчету.ДолгУпрОстатокРасчетный               КАК ДолгУпрОстатокРасчетный,
	|	ВтКРасчету.ПредоплатаОстаток                     КАК ПредоплатаОстаток,
	|	ВтКРасчету.ПредоплатаРеглОстаток                 КАК ПредоплатаРеглОстаток,
	|	ВтКРасчету.ПредоплатаУпрОстаток                  КАК ПредоплатаУпрОстаток,
	|	МАКСИМУМ(ЕСТЬNULL(РасчетыПоСрокам.ПорядокЗачета, """")) КАК ПорядокЗачета,
	|	МАКСИМУМ(ЕСТЬNULL(РасчетыПоСрокам.ВалютаДокумента, """")) КАК ВалютаДокумента
	|ИЗ ВтКРасчету КАК ВтКРасчету
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокам
	|		ПО ВтКРасчету.ЭтоРасчетыСКлиентами
	|			И ВтКРасчету.АналитикаУчетаПоПартнерам = РасчетыПоСрокам.АналитикаУчетаПоПартнерам
	|			И ВтКРасчету.ОбъектРасчетов = РасчетыПоСрокам.ОбъектРасчетов
	|			И ВтКРасчету.Валюта = РасчетыПоСрокам.Валюта
	|			И ВтКРасчету.РасчетныйДокумент = РасчетыПоСрокам.РасчетныйДокумент
	|			И ВтКРасчету.ДатаПлановогоПогашения = РасчетыПоСрокам.ДатаПлановогоПогашения
	|			И РасчетыПоСрокам.Активность
	|СГРУППИРОВАТЬ ПО
	|	ВтКРасчету.ЭтоРасчетыСКлиентами,
	|	ВтКРасчету.АналитикаУчетаПоПартнерам,
	|	ВтКРасчету.ОбъектРасчетов,
	|	ВтКРасчету.Валюта,
	|	ВтКРасчету.РасчетныйДокумент,
	|	ВтКРасчету.ДатаПлановогоПогашения,
	|	ВтКРасчету.ДатаВозникновения,
	|	ВтКРасчету.ВариантКурсаДоговора,
	|	ВтКРасчету.ПредоплатаОстаток,
	|	ВтКРасчету.ПредоплатаРеглОстаток,
	|	ВтКРасчету.ПредоплатаУпрОстаток,
	|	ВтКРасчету.ДолгРеглОстаток,
	|	ВтКРасчету.ДолгРеглОстатокРасчетный,
	|	ВтКРасчету.ДолгУпрОстаток,
	|	ВтКРасчету.ДолгУпрОстатокРасчетный";
	#КонецОбласти

	Запрос.УстановитьПараметр("ЭтоРасчетыСКлиентами", ЭтоРасчетыСКлиентами);
	Если ЭтоРасчетыСКлиентами Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ИмяТаблицы", Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.ПолноеИмя());
		Запрос.УстановитьПараметр("ЗачетАванса", Перечисления.ХозяйственныеОперации.ЗачетАвансаКлиента);
		Запрос.УстановитьПараметр("ТипРасчетов", Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ИмяТаблицы", Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ПолноеИмя());
		Запрос.УстановитьПараметр("ЗачетАванса", Перечисления.ХозяйственныеОперации.ЗачетАвансаПоставщику);
		Запрос.УстановитьПараметр("ТипРасчетов", Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
				Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.ПолноеИмя(),
				Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ПолноеИмя());
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивОрганизаций", МассивОрганизаций);
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета", Параметры.ВалютаУправленческогоУчета);
	
	ГраницаКонецДня = Новый Граница(КонецДня(Период),ВидГраницы.Включая);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Период));
	Запрос.УстановитьПараметр("ГраницаКонецДня", ГраницаКонецДня);
	Запрос.УстановитьПараметр("ДатаРасчета", Период);
	Запрос.УстановитьПараметр("РазмерПорции", ОперативныеВзаиморасчетыСервер.РазмерПорцииЗаписи());
	Если ПереоценкаПоДням = Неопределено Тогда
		ПереоценкаПоДням = Константы.ПереоцениватьВалютныеСредстваПоДням.Получить();
	КонецЕсли;
	Запрос.УстановитьПараметр("ПереоценкаПоДням", ПереоценкаПоДням);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ПоследнийИндекс = РезультатыЗапроса.ВГраница();
	ПоляПоиска = "ЭтоРасчетыСКлиентами, АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта"; 
	ОбъектыКПереоценке = РезультатыЗапроса[ПоследнийИндекс-1].Выгрузить();
	Параметры.ВсегоОбработано = Параметры.ВсегоОбработано + ОбъектыКПереоценке.Количество();
	ДетальныеЗаписи    = РезультатыЗапроса[ПоследнийИндекс].Выгрузить();
	ДетальныеЗаписи.Индексы.Добавить(ПоляПоиска);
	КурсовыеРазницыКУдалению = РезультатыЗапроса[ПоследнийИндекс-2].Выгрузить();
	РегистраторыРасчетов = РезультатыЗапроса[ПоследнийИндекс-3].Выгрузить();
	РегистраторыРасчетов.Индексы.Добавить(ПоляПоиска);
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	
	Порядок = ОперативныеВзаиморасчетыСервер.Порядок(Период,"",Тип("ДокументСсылка.РасчетКурсовыхРазниц"),"9","99");
	РазмерПорцииЗаписи = ОперативныеВзаиморасчетыСервер.РазмерПорцииЗаписи();
	
	ТаблицаИзменений = Новый ТаблицаЗначений;
	ТаблицаИзменений.Колонки.Добавить("Регистратор", Документы.ТипВсеСсылки());
	ДоговорСКомитентом = Перечисления.ТипыДоговоров.СКомитентом;
	Если ЭтоРасчетыСКлиентами Тогда
		ПереоценкаПоложительная 	= Перечисления.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль;
		ПереоценкаОтрицательная 	= Перечисления.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток;
		ПереоценкаПоложительнаяСпр 	= Справочники.НастройкиХозяйственныхОпераций.КурсовыеРазницыКлиентыПрибыль;
		ПереоценкаОтрицательнаяСпр 	= Справочники.НастройкиХозяйственныхОпераций.КурсовыеРазницыКлиентыУбыток;
		НаборЗаписей = РегистрыНакопления.РасчетыСКлиентамиПоСрокам.СоздатьНаборЗаписей();
	Иначе
		ПереоценкаПоложительная 	= Перечисления.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток;
		ПереоценкаОтрицательная 	= Перечисления.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль;
		ПереоценкаПоложительнаяСпр 	= Справочники.НастройкиХозяйственныхОпераций.КурсовыеРазницыПоставщикиУбыток;
		ПереоценкаОтрицательнаяСпр 	= Справочники.НастройкиХозяйственныхОпераций.КурсовыеРазницыПоставщикиПрибыль;
		НаборЗаписей = РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.СоздатьНаборЗаписей();
	КонецЕсли;
	НаборЗаписей.ДополнительныеСвойства.Вставить("ПроверятьИзмененияРегистра", Истина);
	Для Каждого СтрокаПереоценки Из ОбъектыКПереоценке Цикл
		
		Если Параметры.ДокументыПереоценки.Количество() = 1 Тогда
			ДокументРегистратор = Параметры.ДокументыПереоценки[0].Ссылка; //ДокументСсылка
		Иначе
			СтруктураПоискаДокумента = Новый Структура("Дата, Организация", НачалоМесяца(Период), СтрокаПереоценки.Организация);
			НайденныеДокументы = Параметры.ДокументыПереоценки.НайтиСтроки(СтруктураПоискаДокумента);// Массив из СтрокаТаблицыЗначений
			ДокументРегистратор = НайденныеДокументы[0].Ссылка; //ДокументСсылка
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаПереоценки);
		СтрокиДетальныхЗаписей = ДетальныеЗаписи.НайтиСтроки(СтруктураПоиска);
		
		НовСтр = ТаблицаИзменений.Добавить();
		НовСтр.Регистратор = ДокументРегистратор;
		Если СтрокиДетальныхЗаписей.Количество() > 0 И НЕ Параметры.ПерезаполнениеРегистровНУ Тогда
			ТаблицаСвободныхРегистраторов = РегистраторыКурсовыхРазниц(СтрокаПереоценки, РегистраторыРасчетов, СтрокиДетальныхЗаписей.Количество() * 4);
			счРегистратор = 0;
			счСтрок = 0;
			
			РегистраторРасчетов = ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка;
			НаборЗаписей.Отбор.Регистратор.Установить(РегистраторРасчетов);
			НаборЗаписей.Прочитать();
			УдалитьКурсовыеРазницыЗаДень(Период, НаборЗаписей);
			СтрокаКУдалению = КурсовыеРазницыКУдалению.Найти(РегистраторРасчетов,"Регистратор");
			Если СтрокаКУдалению <> Неопределено Тогда
				КурсовыеРазницыКУдалению.Удалить(СтрокаКУдалению);
			КонецЕсли;
			
			Для Каждого СтрокаДетальныхЗаписей Из СтрокиДетальныхЗаписей Цикл
				
				#Область ПоложительнаяКурсоваяРазница
				Если СтрокаДетальныхЗаписей.ДолгРеглОстаток < СтрокаДетальныхЗаписей.ДолгРеглОстатокРасчетный 
					ИЛИ СтрокаДетальныхЗаписей.ДолгУпрОстаток < СтрокаДетальныхЗаписей.ДолгУпрОстатокРасчетный Тогда
					НовСтр = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, СтрокаДетальныхЗаписей);
					
					НовСтр.Регистратор           = ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка;
					НовСтр.ДокументРегистратор   = ДокументРегистратор;
					НовСтр.Период                = КонецДня(Период);
					НовСтр.ПорядокОперации       = Порядок;
					НовСтр.ПорядокЗачета         = Порядок;
					НовСтр.ВидДвижения           = ВидДвиженияНакопления.Приход;
					НовСтр.ХозяйственнаяОперация = ПереоценкаПоложительная;
					НовСтр.Валюта                = СтрокаДетальныхЗаписей.Валюта;
					НовСтр.НастройкаХозяйственнойОперации 	= ПереоценкаПоложительнаяСпр;
					НовСтр.ИдентификаторФинЗаписи			= Строка(Новый УникальныйИдентификатор);
					НовСтр.ТипЗаписиВзаиморасчетов			= Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУвеличениеДолга;

					Если СтрокаДетальныхЗаписей.ДолгРеглОстаток < СтрокаДетальныхЗаписей.ДолгРеглОстатокРасчетный Тогда
						НовСтр.ДолгРегл = СтрокаДетальныхЗаписей.ДолгРеглОстатокРасчетный - СтрокаДетальныхЗаписей.ДолгРеглОстаток;
					КонецЕсли;
					Если СтрокаДетальныхЗаписей.ДолгУпрОстаток < СтрокаДетальныхЗаписей.ДолгУпрОстатокРасчетный Тогда
						НовСтр.ДолгУпр = СтрокаДетальныхЗаписей.ДолгУпрОстатокРасчетный - СтрокаДетальныхЗаписей.ДолгУпрОстаток;
					КонецЕсли;
					
					счСтрок = счСтрок + 1;
					Если счСтрок = РазмерПорцииЗаписи Тогда
						счСтрок = 0;
						счРегистратор = счРегистратор + 1;
						НаборЗаписей.Записать();
						НаборЗаписей.Отбор.Регистратор.Установить(ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка);
						НаборЗаписей.Прочитать();
					КонецЕсли;
					
				КонецЕсли;
				#КонецОбласти
				
				#Область ОтрицательнаяКурсоваяРазница
				Если СтрокаДетальныхЗаписей.ДолгРеглОстаток > СтрокаДетальныхЗаписей.ДолгРеглОстатокРасчетный 
					ИЛИ СтрокаДетальныхЗаписей.ДолгУпрОстаток > СтрокаДетальныхЗаписей.ДолгУпрОстатокРасчетный Тогда
					НовСтр = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, СтрокаДетальныхЗаписей);
					
					НовСтр.Регистратор           = ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка;
					НовСтр.ДокументРегистратор   = ДокументРегистратор;
					НовСтр.Период                = КонецДня(Период);
					НовСтр.ПорядокОперации       = Порядок;
					НовСтр.ПорядокЗачета         = Порядок;
					НовСтр.ВидДвижения           = ВидДвиженияНакопления.Расход;
					НовСтр.ХозяйственнаяОперация = ПереоценкаОтрицательная;
					НовСтр.Валюта                = СтрокаДетальныхЗаписей.Валюта;
					НовСтр.НастройкаХозяйственнойОперации 	= ПереоценкаОтрицательнаяСпр;
					НовСтр.ИдентификаторФинЗаписи			= Строка(Новый УникальныйИдентификатор);
					НовСтр.ТипЗаписиВзаиморасчетов			= Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУменьшениеДолга;

					Если СтрокаДетальныхЗаписей.ДолгРеглОстаток > СтрокаДетальныхЗаписей.ДолгРеглОстатокРасчетный Тогда
						НовСтр.ДолгРегл = СтрокаДетальныхЗаписей.ДолгРеглОстаток - СтрокаДетальныхЗаписей.ДолгРеглОстатокРасчетный;
					КонецЕсли;
					Если СтрокаДетальныхЗаписей.ДолгУпрОстаток > СтрокаДетальныхЗаписей.ДолгУпрОстатокРасчетный Тогда
						НовСтр.ДолгУпр = СтрокаДетальныхЗаписей.ДолгУпрОстаток - СтрокаДетальныхЗаписей.ДолгУпрОстатокРасчетный;
					КонецЕсли;
					
					счСтрок = счСтрок + 1;
					Если счСтрок = РазмерПорцииЗаписи Тогда
						счСтрок = 0;
						счРегистратор = счРегистратор + 1;
						НаборЗаписей.Записать();
						НаборЗаписей.Отбор.Регистратор.Установить(ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка);
						НаборЗаписей.Прочитать();
					КонецЕсли;
					
				КонецЕсли;
				#КонецОбласти
				
				#Область КорректировкаПредоплатыВНоль
				Если СтрокаДетальныхЗаписей.ПредоплатаОстаток = 0
					И (СтрокаДетальныхЗаписей.ПредоплатаРеглОстаток > 0
						ИЛИ СтрокаДетальныхЗаписей.ПредоплатаУпрОстаток > 0) Тогда
					
					НовСтр = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, СтрокаДетальныхЗаписей);
					
					НовСтр.Регистратор           = ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка;
					НовСтр.ДокументРегистратор   = ДокументРегистратор;
					НовСтр.Период                = КонецДня(Период);
					НовСтр.ПорядокОперации       = Порядок;
					НовСтр.ПорядокЗачета         = Порядок;
					НовСтр.ВидДвижения           = ВидДвиженияНакопления.Расход;
					НовСтр.ХозяйственнаяОперация = ПереоценкаПоложительная;
					НовСтр.Валюта                = СтрокаДетальныхЗаписей.Валюта;
					НовСтр.НастройкаХозяйственнойОперации 	= ПереоценкаПоложительнаяСпр;
					НовСтр.ИдентификаторФинЗаписи			= Строка(Новый УникальныйИдентификатор);
					НовСтр.ТипЗаписиВзаиморасчетов			= Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУменьшениеПредоплаты;

					Если СтрокаДетальныхЗаписей.ПредоплатаРеглОстаток > 0 Тогда
						НовСтр.ПредоплатаРегл = СтрокаДетальныхЗаписей.ПредоплатаРеглОстаток;
					КонецЕсли;
					Если СтрокаДетальныхЗаписей.ПредоплатаУпрОстаток > 0 Тогда
						НовСтр.ПредоплатаУпр = СтрокаДетальныхЗаписей.ПредоплатаУпрОстаток;
					КонецЕсли;
					
					счСтрок = счСтрок + 1;
					Если счСтрок = РазмерПорцииЗаписи Тогда
						счСтрок = 0;
						счРегистратор = счРегистратор + 1;
						НаборЗаписей.Записать();
						НаборЗаписей.Отбор.Регистратор.Установить(ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка);
						НаборЗаписей.Прочитать();
					КонецЕсли;
					
				КонецЕсли;
				
				Если СтрокаДетальныхЗаписей.ПредоплатаОстаток = 0
					И (СтрокаДетальныхЗаписей.ПредоплатаРеглОстаток < 0
						ИЛИ СтрокаДетальныхЗаписей.ПредоплатаУпрОстаток < 0) Тогда
					
					НовСтр = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, СтрокаДетальныхЗаписей);
					
					НовСтр.Регистратор           = ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка;
					НовСтр.ДокументРегистратор   = ДокументРегистратор;
					НовСтр.Период                = НачалоДня(Период);
					НовСтр.ПорядокОперации       = Порядок;
					НовСтр.ПорядокЗачета         = Порядок;
					НовСтр.ВидДвижения           = ВидДвиженияНакопления.Приход;
					НовСтр.ХозяйственнаяОперация = ПереоценкаОтрицательная;
					НовСтр.Валюта                = СтрокаДетальныхЗаписей.Валюта;
					НовСтр.НастройкаХозяйственнойОперации 	= ПереоценкаОтрицательнаяСпр;
					НовСтр.ИдентификаторФинЗаписи			= Строка(Новый УникальныйИдентификатор);
					НовСтр.ТипЗаписиВзаиморасчетов			= Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУвеличениеПредоплаты;
					
					Если СтрокаДетальныхЗаписей.ПредоплатаРеглОстаток < 0 Тогда
						НовСтр.ПредоплатаРегл = -СтрокаДетальныхЗаписей.ПредоплатаРеглОстаток;
					КонецЕсли;
					Если СтрокаДетальныхЗаписей.ПредоплатаУпрОстаток < 0 Тогда
						НовСтр.ПредоплатаУпр = -СтрокаДетальныхЗаписей.ПредоплатаУпрОстаток;
					КонецЕсли;
					
					счСтрок = счСтрок + 1;
					Если счСтрок = РазмерПорцииЗаписи Тогда
						счСтрок = 0;
						счРегистратор = счРегистратор + 1;
						НаборЗаписей.Записать();
						НаборЗаписей.Отбор.Регистратор.Установить(ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка);
						НаборЗаписей.Прочитать();
					КонецЕсли;
					
				КонецЕсли;
				#КонецОбласти
				
			КонецЦикла;
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЦикла; //по объектам переоценки
	
	Для Каждого СтрокаКУдалению Из КурсовыеРазницыКУдалению Цикл
		
		Если СтрокаКУдалению.ЭтоРасчетыСКлиентами Тогда
			НаборЗаписей = РегистрыНакопления.РасчетыСКлиентамиПоСрокам.СоздатьНаборЗаписей();
		Иначе
			НаборЗаписей = РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.СоздатьНаборЗаписей();
		КонецЕсли;
		НаборЗаписей.ДополнительныеСвойства.Вставить("ПроверятьИзмененияРегистра", Истина);
		
		НаборЗаписей.Отбор.Регистратор.Установить(СтрокаКУдалению.Регистратор);
		НаборЗаписей.Прочитать();
		Если УдалитьКурсовыеРазницыЗаДень(Период, НаборЗаписей) Тогда
			НаборЗаписей.Записать(); //удалим старые курсовые разницы
		КонецЕсли;
	КонецЦикла;
	
	ПоляСворачивания = "Регистратор";
	ТаблицаИзменений.Свернуть(ПоляСворачивания);
	
	Если ЭтоРасчетыСКлиентами <> Неопределено Тогда
		Для Каждого Организация Из МассивОрганизаций Цикл
			
			ДокументыРасчетаКурсовыхРазниц = Документы.РасчетКурсовыхРазниц.ДокументыПереоценки(Организация,
				Период, Период,
				ЭтоРасчетыСКлиентами);
			ДокументРегистратор = ДокументыРасчетаКурсовыхРазниц[НачалоМесяца(Период)];
			
			Если ЭтоРасчетыСКлиентами Тогда
				НаборДвиженийПоДокументам = РегистрыНакопления.РасчетыСКлиентамиПоДокументам.СоздатьНаборЗаписей();
			Иначе
				НаборДвиженийПоДокументам = РегистрыНакопления.РасчетыСПоставщикамиПоДокументам.СоздатьНаборЗаписей();
			КонецЕсли;
			
			НаборДвиженийПоДокументам.Отбор.Регистратор.Установить(ДокументРегистратор);
			НаборДвиженийПоДокументам.Прочитать();
			Если НаборДвиженийПоДокументам.Количество() > 0 Тогда
				НаборДвиженийПоДокументам.Очистить();
				НаборДвиженийПоДокументам.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция УдалитьКурсовыеРазницыЗаДень(Период, НаборЗаписей)
	
	Индекс = 0;
	БылоУдаление = Ложь;
	Пока Индекс < НаборЗаписей.Количество() Цикл
		Запись = НаборЗаписей[Индекс];
		
		Если НачалоДня(Запись.Период) = НачалоДня(Период)
			И ТипЗнч(Запись.ДокументРегистратор) = Тип("ДокументСсылка.РасчетКурсовыхРазниц") Тогда
			НаборЗаписей.Удалить(Запись);
			БылоУдаление = Истина;
			Продолжить;
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Возврат БылоУдаление;
	
КонецФункции

// Удаляет движения курсовых разниц за период только по тем дням,
// по которым в текущем периоде больше не будет переоценки.
// Например оплата пренесена на другой дату и на текущую дату больше нет объектов для переоценки
// или был режим переоценки по дням, а стал режим переоценки на дату оплаты и конец месяца.
// 
Процедура УдалитьКурсовыеРазницыЗаПериод(МассивОрганизаций, НачалоПериода, КонецПериода, Параметры)
	
	Если Параметры.ЭтоРасчетыСКлиентами = Неопределено Тогда
		ИмяЗамера = "Взаиморасчеты.РасчетКурсовыхРазницПоСрокам.Удаление";
	Иначе
		ИмяЗамера = "Взаиморасчеты.РасчетКурсовыхРазницПоСрокам" + ?(Параметры.ЭтоРасчетыСКлиентами,".Клиенты",".Поставщики")+".Удаление";
	КонецЕсли;
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(ИмяЗамера);
	
	#Область ТекстЗапроса
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДниПереоценки.Дата КАК Дата
	|ПОМЕСТИТЬ втДниПереоценки
	|ИЗ
	|	&ДниПереоценки КАК ДниПереоценки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Дни осутствия курсовых разниц - дни в которых при новом расчете движений курсовых разниц не будет
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Дата КАК Дата,
	|	СУММА(ВложенныйЗапрос.ПредыдущаяПереоценка) КАК ПредыдущаяПереоценка
	|ПОМЕСТИТЬ втПредыдущаяПереоценка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДниПереоценки.Дата КАК Дата,
	|		1 КАК ПредыдущаяПереоценка
	|	ИЗ
	|		втДниПереоценки КАК ДниПереоценки
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		НАЧАЛОПЕРИОДА(Расчеты.Период, ДЕНЬ) КАК Дата,
	|		-1 КАК ПредыдущаяПереоценка
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ПО Расчеты.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ПО (КлючиАналитикиУчетаПоПартнерам.Организация = Организации.Ссылка)
	|	ГДЕ
	|		Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Организации.Ссылка В(&Организации)
	|		И Расчеты.ДокументРегистратор ССЫЛКА Документ.РасчетКурсовыхРазниц
	|) КАК ВложенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Дата
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.ПредыдущаяПереоценка) = -1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Регистраторы расчетов за указанные период, у которых есть движений курсовых разниц
	// при условии, что есть даты отсутствия курсовых разниц
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами,
	|	РасчетыПоСрокам.Регистратор КАК РегистраторРасчетов,
	|	КОЛИЧЕСТВО(Переоценка.Дата) КАК ДатыОтсутствияКурсовыхРазниц
	|ПОМЕСТИТЬ втРегистраторыРасчетов
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокам
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитики
	|	ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = КлючиАналитики.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПредыдущаяПереоценка КАК Переоценка
	|	ПО ИСТИНА
	|ГДЕ
	|	РасчетыПоСрокам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И КлючиАналитики.Организация В (&Организации)
	|	И ТИПЗНАЧЕНИЯ(РасчетыПоСрокам.ДокументРегистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоСрокам.Регистратор
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(Переоценка.Дата) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Все движения регистраторов расчета, кроме движений курсовых разниц в дни отсутствия
	|ВЫБРАТЬ
	|	&ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами,
	|	*
	|ПОМЕСТИТЬ втДвиженияРегистраторов
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСПоСрокам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРегистраторыРасчетов КАК РегистраторыРасчетов
	|		ПО РасчетыСПоСрокам.Регистратор = РегистраторыРасчетов.РегистраторРасчетов
	|ГДЕ
	|	НЕ (ТИПЗНАЧЕНИЯ(РасчетыСПоСрокам.ДокументРегистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|		И НАЧАЛОПЕРИОДА(РасчетыСПоСрокам.Период, ДЕНЬ) В (ВЫБРАТЬ Дата ИЗ втПредыдущаяПереоценка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Регистраторы расчетов которые остались без движений
	|ВЫБРАТЬ
	|	РегистраторыРасчетов.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами,
	|	РегистраторыРасчетов.РегистраторРасчетов КАК Регистратор
	|ИЗ
	|	втРегистраторыРасчетов КАК РегистраторыРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДвиженияРегистраторов КАК ДвиженияРегистраторов
	|		ПО РегистраторыРасчетов.РегистраторРасчетов = ДвиженияРегистраторов.Регистратор
	|ГДЕ
	|	ДвиженияРегистраторов.Регистратор ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	втДвиженияРегистраторов КАК ДвиженияРегистраторов
	|
	|ИТОГИ
	|	МАКСИМУМ(ЭтоРасчетыСКлиентами)
	|ПО
	|	Регистратор";
	#КонецОбласти
	
	Если НЕ Параметры.ЭтоРасчетыСКлиентами Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
				Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.ПолноеИмя(),
				Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ПолноеИмя());
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДниПереоценки", Параметры.ДниПереоценки);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Организации", МассивОрганизаций);
	Запрос.УстановитьПараметр("ЭтоРасчетыСКлиентами", Параметры.ЭтоРасчетыСКлиентами);
	РезультатПакета = Запрос.ВыполнитьПакет();
	ПоследнийПакет = РезультатПакета.ВГраница();
	
	Выборка = РезультатПакета[ПоследнийПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВсегоОбработано = 0;
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоРасчетыСКлиентами Тогда
			НаборЗаписей = РегистрыНакопления.РасчетыСКлиентамиПоСрокам.СоздатьНаборЗаписей();
		Иначе
			НаборЗаписей = РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.СоздатьНаборЗаписей();
		КонецЕсли;
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		Движения = Выборка.Выбрать();
		Пока Движения.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Движения);
		КонецЦикла;
		НаборЗаписей.Записать();
 		ВсегоОбработано = ВсегоОбработано + 1;
	КонецЦикла;
	
	// Регистраторы которые остались без движений
	Выборка = РезультатПакета[ПоследнийПакет-1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоРасчетыСКлиентами Тогда
			НаборЗаписей = РегистрыНакопления.РасчетыСКлиентамиПоСрокам.СоздатьНаборЗаписей();
		Иначе
			НаборЗаписей = РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.СоздатьНаборЗаписей();
		КонецЕсли;
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Записать();
		ВсегоОбработано = ВсегоОбработано + 1;
	КонецЦикла;
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, ВсегоОбработано);
	
КонецПроцедуры

Функция ДниПереоценки(МассивОрганизаций, НачалоПериода, КонецПериода, Параметры)
	
	#Область ТекстЗапроса
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Валюта КАК Валюта,
	|	НАЧАЛОПЕРИОДА(Расчеты.Период, ДЕНЬ) КАК Период
	|ПОМЕСТИТЬ втОборотыВалюты
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|		ПО Расчеты.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО КлючиАналитикиУчетаПоПартнерам.Организация = Организации.Ссылка
	|ГДЕ
	|	Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Организации.Ссылка В (&Организации)
	|	И (Расчеты.Валюта <> &ВалютаУправленческогоУчета ИЛИ Расчеты.Валюта <> Организации.ВалютаРегламентированногоУчета)
	|	И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Расчеты.Долг <> 0
	|;";
	Если НЕ Параметры.ЭтоРасчетыСКлиентами Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
				Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.ПолноеИмя(),
				Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ПолноеИмя());
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втОборотыВалюты.Период КАК Дата
	|ИЗ
	|	втОборотыВалюты КАК втОборотыВалюты
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КурсыВалют.Период
	|ИЗ
	|	РегистрСведений.ОтносительныеКурсыВалют КАК КурсыВалют
	|ГДЕ
	|	КурсыВалют.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И &ПереоценкаПоДням
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	#КонецОбласти
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Организации",   МассивОрганизаций);
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета",  Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("ПереоценкаПоДням",  Параметры.ПереоценкаПоДням);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выборка;
	
КонецФункции

Функция РегистраторыКурсовыхРазниц(ТекущиеПараметры, РегистраторыРасчетов, КоличествоЗаписей)
	
	Если КоличествоЗаписей = 0 Тогда
		КоличествоРегистраторов = 0;
	Иначе
		КоличествоРегистраторов = Цел(КоличествоЗаписей/ОперативныеВзаиморасчетыСервер.РазмерПорцииЗаписи()) + 1;
	КонецЕсли;
	
	Отбор = Новый Структура("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта,ЭтоРасчетыСКлиентами");
	ЗаполнитьЗначенияСвойств(Отбор, ТекущиеПараметры);
	
	ТипРасчетов = ?(ТекущиеПараметры.ЭтоРасчетыСКлиентами, Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом, Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком);
	ТаблицаДокументов = РегистраторыРасчетов.Скопировать(Отбор); // см.СвободныеРегистраторыРасчетов
	
	Пока ТаблицаДокументов.Количество() < КоличествоРегистраторов Цикл
		ДокументОбъект = Документы.РегистраторРасчетов.СоздатьДокумент();
		ДокументОбъект.Валюта = ТекущиеПараметры.Валюта;
		ДокументОбъект.АналитикаУчетаПоПартнерам = ТекущиеПараметры.АналитикаУчетаПоПартнерам;
		ДокументОбъект.Организация = ТекущиеПараметры.Организация;
		ДокументОбъект.ОбъектРасчетов = ТекущиеПараметры.ОбъектРасчетов;
		ДокументОбъект.ТипРасчетов = ТипРасчетов;
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		НовСтр = ТаблицаДокументов.Добавить();
		НовСтр.Ссылка = ДокументОбъект.Ссылка;
	КонецЦикла;
	
	Возврат ТаблицаДокументов;
	
КонецФункции


#КонецОбласти
